import os
from django.test import TestCase, override_settings
from django.conf import settings
from django.utils.six import StringIO
from django.core.management import call_command
from voting import models


@override_settings(VOTING_PDF_DIR=os.path.join(settings.BASE_DIR, 'voting', 'fixtures', 'voting_files'))
class TestParseLawCommand(TestCase):
    """
    Тестирование комманды парсинга законов
    Запуск комманды для тестового файла,
    проверка данных в базе и правильных данных
    """

    def setUp(self):
        self.out = StringIO()
        call_command('parse_law', stdout=self.out)

        self.counsil = 'Броварська міська рада'
        self.counsil_session = '21 позачергова сесія  VІІ скликання від 11.11.16'
        self.law_files = [
            'Результат поіменного голосування_11.11.2016/law-1.html',
            'Результат поіменного голосування_11.11.2016/law-2.html',
            'Результат поіменного голосування_11.11.2016/law-3.html',
            'Результат поіменного голосування_11.11.2016/law-4.html',
            'Результат поіменного голосування_11.11.2016/law-5.html',
            'Результат поіменного голосування_11.11.2016/law-6.html',
        ]
        self.laws = [
            'Про затвердження порядку денного, stored in file "Результат поіменного голосування_11.11.2016/law-1.html"',
            'Про включення до порядку  денного питання "Різне", stored in file "Результат поіменного голосування_11.11.2016/law-2.html"',
            'Про затвердження порядку денного, stored in file "Результат поіменного голосування_11.11.2016/law-3.html"',
            '1. Про надання дозволу на укладення договору на проведення робіт, проектування та монтажу без застосування електронної процедури закупівель., stored in file "Результат поіменного голосування_11.11.2016/law-4.html"',
            '1. Про внесення  змін в преамбулу проекту рішення - замість ст.26  вказати ст.25 Закону., stored in file "Результат поіменного голосування_11.11.2016/law-5.html"',
            '1. Про надання дозволу на укладення договору на проведення робіт, проектування та монтажу без застосування електронної процедури закупівель., stored in file "Результат поіменного голосування_11.11.2016/law-6.html"',
        ]
        self.deputies = [
            'Сапожко Ігор Васильович',
            'Бабич Петро Іванович',
            'Мельник Оксана Миколаївна',
            'Лемпіцький Валерій Анатолійович',
            'Тоцька Тетяна Петрівна',
            'Сенько Лідія Іванівна',
            'Темченко Людмила Григорівна',
            'Василенко Андрій Петрович',
            'Скотніков Юрій Анатолійович',
            'Чаюн Володимир Григорович',
            'Крилова Тетяна Миколаївна',
            'Семенов Максим Володимирович',
            'Бойко Сергій Олександрович',
            'Шевчук Олег Сергійович',
            'Здоровець Олексій Михайлович',
            'Андрієвський Вадим Анатолійович',
            'Коваленко Вікторія Миколаївна',
            'Кочубей Василь Михайлович',
            'Гредунов Євгеній Валерійович',
            'Іваненко Валерій Іванович',
            'Веремчук Ірина Сергіївна',
            'Опалько Володимир Григорович',
            'Батюк Сергій Іванович',
            'Бельський Сергій Костянтинович',
            'Негода Галина Василівна',
            'Тютюнник Андрій Анатолійович',
            'Мутило Вадим Анатолійович',
            'Дудко Борис Володимирович',
            'Чередник Юрій Павлович',
            'Дяченко Аліна Олексіївна',
            'Лопатюк Андрій Михайлович',
            'Берестовий Олег Ігорович',
            'Саук Андрій Миколайович',
            'Оксютенко Володимир Миколайович',
            'Черепейнік Леонід Володимирович',
            'Зінченко Микола Андрійович',
            'Білокінь Володимир Олексійович'
        ]

        self.deputies_voting = {
            'Результат поіменного голосування_11.11.2016/law-1.html': {
                'Сапожко Ігор Васильович': 'За',
                'Бабич Петро Іванович': 'За',
                'Мельник Оксана Миколаївна': 'За',
                'Лемпіцький Валерій Анатолійович': 'Відсутній',
                'Тоцька Тетяна Петрівна': 'За',
                'Сенько Лідія Іванівна': 'За',
                'Темченко Людмила Григорівна': 'За',
                'Василенко Андрій Петрович': 'Відсутній',
                'Скотніков Юрій Анатолійович': 'За',
                'Чаюн Володимир Григорович': 'За',
                'Крилова Тетяна Миколаївна': 'Відсутній',
                'Семенов Максим Володимирович': 'Відсутній',
                'Бойко Сергій Олександрович': 'Відсутній',
                'Шевчук Олег Сергійович': 'Відсутній',
                'Здоровець Олексій Михайлович': 'Відсутній',
                'Андрієвський Вадим Анатолійович': 'За',
                'Коваленко Вікторія Миколаївна': 'За',
                'Кочубей Василь Михайлович': 'За',
                'Гредунов Євгеній Валерійович': 'Відсутній',
                'Іваненко Валерій Іванович': 'За',
                'Веремчук Ірина Сергіївна': 'За',
                'Опалько Володимир Григорович': 'За',
                'Батюк Сергій Іванович': 'За',
                'Бельський Сергій Костянтинович': 'За',
                'Негода Галина Василівна': 'За',
                'Тютюнник Андрій Анатолійович': 'За',
                'Мутило Вадим Анатолійович': 'За',
                'Дудко Борис Володимирович': 'За',
                'Чередник Юрій Павлович': 'За',
                'Дяченко Аліна Олексіївна': 'Відсутній',
                'Лопатюк Андрій Михайлович': 'За',
                'Берестовий Олег Ігорович': 'Утримався',
                'Саук Андрій Миколайович': 'Утримався',
                'Оксютенко Володимир Миколайович': 'За',
                'Черепейнік Леонід Володимирович': 'Не голосував',
                'Зінченко Микола Андрійович': 'За',
                'Білокінь Володимир Олексійович': 'За'
            },
            'Результат поіменного голосування_11.11.2016/law-2.html': {
                'Сапожко Ігор Васильович': 'За',
                'Бабич Петро Іванович': 'За',
                'Мельник Оксана Миколаївна': 'За',
                'Лемпіцький Валерій Анатолійович': 'Відсутній',
                'Тоцька Тетяна Петрівна': 'За',
                'Сенько Лідія Іванівна': 'За',
                'Темченко Людмила Григорівна': 'За',
                'Василенко Андрій Петрович': 'Відсутній',
                'Скотніков Юрій Анатолійович': 'За',
                'Чаюн Володимир Григорович': 'За',
                'Крилова Тетяна Миколаївна': 'Відсутній',
                'Семенов Максим Володимирович': 'Відсутній',
                'Бойко Сергій Олександрович': 'Відсутній',
                'Шевчук Олег Сергійович': 'Відсутній',
                'Здоровець Олексій Михайлович': 'Відсутній',
                'Андрієвський Вадим Анатолійович': 'Не голосував',
                'Коваленко Вікторія Миколаївна': 'За',
                'Кочубей Василь Михайлович': 'Утримався',
                'Гредунов Євгеній Валерійович': 'Відсутній',
                'Іваненко Валерій Іванович': 'Не голосував',
                'Веремчук Ірина Сергіївна': 'За',
                'Опалько Володимир Григорович': 'За',
                'Батюк Сергій Іванович': 'За',
                'Бельський Сергій Костянтинович': 'За',
                'Негода Галина Василівна': 'За',
                'Тютюнник Андрій Анатолійович': 'За',
                'Мутило Вадим Анатолійович': 'За',
                'Дудко Борис Володимирович': 'Утримався',
                'Чередник Юрій Павлович': 'За',
                'Дяченко Аліна Олексіївна': 'Відсутній',
                'Лопатюк Андрій Михайлович': 'За',
                'Берестовий Олег Ігорович': 'За',
                'Саук Андрій Миколайович': 'За',
                'Оксютенко Володимир Миколайович': 'За',
                'Черепейнік Леонід Володимирович': 'Не голосував',
                'Зінченко Микола Андрійович': 'За',
                'Білокінь Володимир Олексійович': 'Утримався'
            }

        }

    def test_command_output(self):

        # открылась правильная директория
        self.assertIn("Start with dir", self.out.getvalue())

        # создается совет
        self.assertIn("created a counsil - {}".format(self.counsil), self.out.getvalue())

        # создается сессия совета
        self.assertIn("created a counsil_session - {}".format(self.counsil_session), self.out.getvalue())

        # парсинг нашел все файлы
        for law_file in self.law_files:
            self.assertIn(law_file, self.out.getvalue())

        # создаются все законы из сессии
        for law in self.laws:
            self.assertIn('created a session law - {}'.format(law), self.out.getvalue())

        # создаются вс депутаты сессии
        for deputy in self.deputies:
            self.assertIn("created a deputy - {}".format(deputy), self.out.getvalue())

    def test_command_saved_data(self):
        """Проверяем сохраненные данные в базе"""
        deputies = models.Deputy.objects.all()

        # количество созданных  депутатов
        self.assertEqual(len(deputies), len(self.deputies))

        # пересечение созданных депутатов
        deputies_name = [deputy.name for deputy in deputies]
        deputies_name_set = set(deputies_name)
        self_deputies_name_set = set(self.deputies)
        self.assertTrue(self_deputies_name_set.intersection(deputies_name_set))

        laws = models.Law.objects.all()
        # количество созданных законов
        self.assertEqual(len(laws), len(self.laws))


    def test_deputy_voting(self):
        """Проверяем голоса депутатов по законам"""

        for law_file in self.deputies_voting:
            law = models.Law.objects.get(law_file_name=law_file)
            law_voting = models.LawVoting.objects.filter(law=law)
            for row in law_voting:
                self.assertTrue( row.deputy.name in self.deputies_voting[law_file].keys())
                self.assertEqual(row.vote, self.deputies_voting[law_file][row.deputy.name])
